<!--제목-->
<h3>2차원배열 만들기2</h3>



<!--코드-->
<hr><h4>소스코드</h4> <hr>
<pre>
$arr = array(
    array('국어'=>100, '영어'=>100, '수학'=>80),
    array('국어'=>90, '영어'=>100, '수학'=>90),
    array('국어'=>80, '영어'=>80, '수학'=>100)
);

for($i=0 ; $i < count($arr) ; $i++){
    echo $arr[$i]['국어'] . ',' . $arr[$i]['영어'] . ',' . $arr[$i]['수학'];
    echo "< br>";
}
</pre>

<!--결과-->
<hr><h4>결과</h4> <hr>
<?php
$arr = array(
    array('국어'=>100, '영어'=>100, '수학'=>80),
    array('국어'=>90, '영어'=>100, '수학'=>90),
    array('국어'=>80, '영어'=>80, '수학'=>100)
);

for($i=0 ; $i < count($arr) ; $i++){
    echo $arr[$i]['국어'] . ',' . $arr[$i]['영어'] . ',' . $arr[$i]['수학'];
    echo "<br>";
}
?>


